use Высоцкий_MyBase;
go
insert into Details(Название_детали, Артикул)
	values
		('Поршень',123),
		('Коленвал',1654),
		('Термостат',543),
		('Руль',54665),
		('АКПП',3534),
		('МКПП',98765),
		('Ремень_вариатора',34639),
		('Радиатор',79256),
		('Топливный_насос',35433),
		('Тормозная_колодка',4356),
		('Тормозной_диск',546576),
		('Турбина',234352),
		('Подрамник',4576332),
		('Кольца',132),
		('Маховик',1555);
insert into Postavshiki(Название, Город, Телефон, Улица, Дом)
	values
		('Auto_idea','Минск','291276489','Чистая','56'),
		('Auto_details','Минск','296593675','Свердлова','12'),
		('Motors','Гродно','338926848','Литейная','7'),
		('Details_KPP','Гомель','257590090','Мира','45'),
		('Auto_fix','Могилёв','336111759','Лесная','20');
insert into Details_Postavshiki(Код, ID, Количество_деталей)
	values
		(1,9,20),
		(1,1,4),
		(1,3,2),
		(2,3,1),
		(2,15,2),
		(3,2,1),
		(4,12,5),
		(5,13,1),
		(5,13,6);

insert into ZAKAZANO(ID, Количество, Date_zakaza)
	values
		(3,1,'2023-01-10'),
		(10,4,'2023-05-25'),
		(15,1,'2023-06-04'),
		(8,2,'2023-07-03'),
		(13,1,'2023-08-15'),
		(3,1,'2023-08-22'),
		(14,8,'2023-09-15');